In [1]:
import pandas as pd

In [4]:
dict1 ={
    "employee":["Bob","Jacob","Lisa","Sue"],
    "group":["Accounting","Engineering","Engineering","HR"]
}

df1= pd.DataFrame(dict1)

dict2 ={
    "employee":["Bob","Jacob","Lisa","Sue"],
    "Hire date":[2004,2008,2012,2014]
}

df2 = pd.DataFrame(dict2)

  employee  Hire date
0      Bob       2004
1    Jacob       2008
2     Lisa       2012
3      Sue       2014

In [12]:
temp =[]
counter = 0
for i,j in zip(df1["employee"],df2["employee"]):  
    if(i == j):
            temp.append(df2["Hire date"][counter])
            counter = counter + 1
df1['Hire date'] = temp
df1

  employee        group  Hire date
0      Bob   Accounting       2004
1    Jacob  Engineering       2008
2     Lisa  Engineering       2012
3      Sue           HR       2014

In [9]:
print(df2["Hire date"][1])

2008

In [14]:
temp =[]
counter = 0
for i,j in zip(df1["employee"],df2["employee"]):  
    if(i == j):
            temp.append(df1["group"][counter])
            counter = counter + 1
df2['Group'] = temp
df2

  employee  Hire date        Group
0      Bob       2004   Accounting
1    Jacob       2008  Engineering
2     Lisa       2012  Engineering
3      Sue       2014           HR